In [65]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [150]:
import pandas as pd

In [151]:
import os
os.getcwd()

'C:\\Users\\HP\\Python Data Science Class'

In [152]:
data = pd.read_csv(r"C:\Users\HP\Downloads\sample_data.csv")

In [153]:
data.head()

    ID     Name   Age Department   Salary           City
0  101    Alice  25.0         HR  50000.0       New York
1  102      Bob  30.0         IT  60000.0    Los Angeles
2  103  Charlie  35.0    Finance  70000.0        Chicago
3  104    David  40.0  Marketing  80000.0  San Francisco
4  105      Eve   NaN         IT  75000.0        Houston

In [95]:
data.tail()

    ID   Name   Age Department   Salary     City
5  106  Frank  45.0    Finance  65000.0  Seattle
6  107  Grace  50.0         HR  72000.0   Boston
7  108   Hank  28.0  Marketing  55000.0   Denver
8  109    Ivy  33.0         IT  62000.0    Miami
9  110   Jack  38.0    Finance      NaN   Dallas

In [160]:
#Cleaning data age
data_cleaned["Age"] = data_cleaned["Age"].astype(int)

C:\Users\HP\AppData\Local\Temp\ipykernel_5856\2572329606.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_cleaned["Age"] = data_cleaned["Age"].astype(int)

In [161]:
data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 8
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          8 non-null      int64
 1   Name        8 non-null      object
 2   Age         8 non-null      int32
 3   Department  8 non-null      object
 4   Salary      8 non-null      float64
 5   City        8 non-null      object
dtypes: float64(1), int32(1), int64(1), object(3)
memory usage: 416.0+ bytes

In [162]:
#cleaning salaries data
data_cleaned["Salary"] = data_cleaned["Salary"].astype(int)

C:\Users\HP\AppData\Local\Temp\ipykernel_5856\1895902284.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_cleaned["Salary"] = data_cleaned["Salary"].astype(int)

In [163]:
data_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 8
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          8 non-null      int64
 1   Name        8 non-null      object
 2   Age         8 non-null      int32
 3   Department  8 non-null      object
 4   Salary      8 non-null      int32
 5   City        8 non-null      object
dtypes: int32(2), int64(1), object(3)
memory usage: 384.0+ bytes

In [154]:
#Understanding the NULL data values
data.isnull().sum()

ID            0
Name          0
Age           1
Department    0
Salary        1
City          0
dtype: int64

In [159]:
#data cleaning process
data_cleaned = data.dropna()
data_cleaned

    ID     Name   Age Department   Salary           City
0  101    Alice  25.0         HR  50000.0       New York
1  102      Bob  30.0         IT  60000.0    Los Angeles
2  103  Charlie  35.0    Finance  70000.0        Chicago
3  104    David  40.0  Marketing  80000.0  San Francisco
5  106    Frank  45.0    Finance  65000.0        Seattle
6  107    Grace  50.0         HR  72000.0         Boston
7  108     Hank  28.0  Marketing  55000.0         Denver
8  109      Ivy  33.0         IT  62000.0          Miami

In [166]:
#To know how your data has been finally cleaned 
data_cleaned.to_csv("cleaned_data.csv")

In [96]:
#Understanding the data information
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         9 non-null      float64
 3   Department  10 non-null     object
 4   Salary      9 non-null      float64
 5   City        10 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 612.0+ bytes

In [97]:
#Describe my data
data.describe()

              ID        Age        Salary
count   10.00000   9.000000      9.000000
mean   105.50000  36.000000  65444.444444
std      3.02765   8.124038   9722.539677
min    101.00000  25.000000  50000.000000
25%    103.25000  30.000000  60000.000000
50%    105.50000  35.000000  65000.000000
75%    107.75000  40.000000  72000.000000
max    110.00000  50.000000  80000.000000

In [126]:
#Importing json dataset in pandas
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hank', 'Ivy', 'Jack', 'Karen', 'Leo'],
    'Age': [25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego', 'Dallas', 'San Jose', 'Austin', 'Jacksonville']
}

In [132]:
df = pd.DataFrame(data)

In [157]:
subset = df.head(11)

In [135]:
#working with json dataset
subset.to_json('output_head_11.json', orient='records', lines=True) 
subset.to_json

<bound method NDFrame.to_json of        Name  Age          City
0     Alice   25      New York
1       Bob   30   Los Angeles
2   Charlie   35       Chicago
3     David   40       Houston
4       Eva   45       Phoenix
5     Frank   50  Philadelphia
6     Grace   55   San Antonio
7      Hank   60     San Diego
8       Ivy   65        Dallas
9      Jack   70      San Jose
10    Karen   75        Austin>

In [142]:
#to know if there is a missing value in our json dataset
missing_values = df.isnull()
missing_values

     Name    Age   City
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False  False
11  False  False  False

In [169]:
#working with new dataset
new_data = {'name': ['Alice', 'Bob', 'Charlie'], 'Age': [25,30,35], 'city': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(new_data)
df

      name  Age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [176]:
#Cleaning HR Department
HR_dept = data_cleaned[data_cleaned["Department"] == "HR"]
HR_dept

    ID   Name  Age Department  Salary      City
0  101  Alice   25         HR   50000  New York
6  107  Grace   50         HR   72000    Boston

In [177]:
#Cleaning Finance Department
Finance_dept = data_cleaned[data_cleaned["Department"] == "Finance"]
Finance_dept

    ID     Name  Age Department  Salary     City
2  103  Charlie   35    Finance   70000  Chicago
5  106    Frank   45    Finance   65000  Seattle

In [178]:
#Cleaning IT Department
IT_dept = data_cleaned[data_cleaned["Department"] == "IT"]
IT_dept

    ID Name  Age Department  Salary         City
1  102  Bob   30         IT   60000  Los Angeles
8  109  Ivy   33         IT   62000        Miami

In [179]:
#Cleaning Marketing Department
Marketing_dept = data_cleaned[data_cleaned["Department"] == "Marketing"]
Marketing_dept

    ID   Name  Age Department  Salary           City
3  104  David   40  Marketing   80000  San Francisco
7  108   Hank   28  Marketing   55000         Denver

In [180]:
#Analyzing two departments with the highest Salary that is > 50,000 
HR_dept2 = data_cleaned[(data_cleaned["Department"] == "HR") & (data_cleaned["Salary"]> 50000)]
HR_dept2

    ID   Name  Age Department  Salary    City
6  107  Grace   50         HR   72000  Boston

In [181]:
#Data Sorting
names = ["mike", "paul", "lekan", "abdul"]
names

['mike', 'paul', 'lekan', 'abdul']

In [182]:
names.sort()

In [183]:
names

['abdul', 'lekan', 'mike', 'paul']

In [184]:
sorted_data = data_cleaned.sort_values(by='Age')
sorted_data

    ID     Name  Age Department  Salary           City
0  101    Alice   25         HR   50000       New York
7  108     Hank   28  Marketing   55000         Denver
1  102      Bob   30         IT   60000    Los Angeles
8  109      Ivy   33         IT   62000          Miami
2  103  Charlie   35    Finance   70000        Chicago
3  104    David   40  Marketing   80000  San Francisco
5  106    Frank   45    Finance   65000        Seattle
6  107    Grace   50         HR   72000         Boston